## Plan Result (sbox-hmcts_soc_sbox-acme)




<pre><code>Plan: 1 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * module.acme.azurerm_storage_account.stg
* Update
  * module.acme.azurerm_application_insights.appinsight
  * module.acme.azurerm_key_vault.kv
  * module.acme.azurerm_resource_group.rg
  * module.acme.azurerm_service_plan.asp
  * module.acme.azurerm_windows_function_app.funcapp




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.acme.azurerm_application_insights.appinsight will be updated in-place
  ~ resource "azurerm_application_insights" "appinsight" {
        id                                    = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/resourceGroups/soc-sbox-rg/providers/microsoft.insights/components/soc-sbox"
        name                                  = "soc-sbox"
      ~ tags                                  = {
          ~ "application"  = "core" -> "security"
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (3 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acme.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
      ~ enabled_for_deployment          = false -> true
        id                              = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/resourceGroups/soc-sbox-rg/providers/Microsoft.KeyVault/vaults/acmehmctssocsbox"
        name                            = "acmehmctssocsbox"
      ~ tags                            = {
          ~ "application"  = "core" -> "security"
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.acme.azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/resourceGroups/soc-sbox-rg"
        name     = "soc-sbox-rg"
      ~ tags     = {
          ~ "application"  = "core" -> "security"
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.acme.azurerm_service_plan.asp will be updated in-place
  ~ resource "azurerm_service_plan" "asp" {
        id                           = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/resourceGroups/soc-sbox-rg/providers/Microsoft.Web/serverfarms/soc-sbox-asp"
        name                         = "soc-sbox-asp"
      ~ tags                         = {
          ~ "application"  = "core" -> "security"
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (3 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.acme.azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "acmehmctssocsbox"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "soc-sbox-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "security"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
        }

      + blob_properties {
          + change_feed_enabled           = (known after apply)
          + change_feed_retention_in_days = (known after apply)
          + default_service_version       = (known after apply)
          + last_access_time_enabled      = (known after apply)
          + versioning_enabled            = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.acme.azurerm_windows_function_app.funcapp will be updated in-place
  ~ resource "azurerm_windows_function_app" "funcapp" {
      ~ app_settings                      = {
          - "Acmebot:AzureDns:SubscriptionId"            = "ed302caf-ec27-4c64-a05e-85731c3ce90e"
          - "Acmebot:Contacts"                           = "cnp-acme-owner@hmcts.net"
          - "Acmebot:Endpoint"                           = "https://acme-v02.api.letsencrypt.org/"
          - "Acmebot:Environment"                        = "AzureCloud"
          - "Acmebot:VaultBaseUrl"                       = "https://acmehmctssocsbox.vault.azure.net/"
          - "ApplicationInsightsAgent_EXTENSION_VERSION" = "~2"
          - "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET"   = "niM8Q~jyNIbfeqAS3mtnNBL0T1YaGP4dzLa14bpU"
          - "WEBSITE_RUN_FROM_PACKAGE"                   = "https://shibayan.blob.core.windows.net/azure-keyvault-letsencrypt/v3/latest.zip"
        } -> (known after apply)
      ~ client_certificate_mode           = "Required" -> "Optional"
      ~ functions_extension_version       = "~3" -> "~4"
        id                                = "/subscriptions/2307d175-7e49-434b-9ac2-515529b845f2/resourceGroups/soc-sbox-rg/providers/Microsoft.Web/sites/acmehmctssocsbox"
        name                              = "acmehmctssocsbox"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ storage_account_access_key        = (sensitive value)
      + storage_key_vault_secret_id       = ""
      ~ tags                              = {
          ~ "application"  = "core" -> "security"
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise-acme"
            # (3 unchanged elements hidden)
        }
      + virtual_network_subnet_id         = ""
        # (20 unchanged attributes hidden)

      ~ auth_settings {
          + default_provider               = "AzureActiveDirectory"
          - issuer                         = "https://sts.windows.net/531ff96d-0ae9-462a-8d2d-bec7c0b42082/v2.0" -> null
          ~ token_store_enabled            = true -> false
            # (6 unchanged attributes hidden)

          ~ active_directory {
              - client_secret_setting_name = "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET" -> null
                # (2 unchanged attributes hidden)
            }
        }

      ~ site_config {
          + api_definition_url                     = ""
          + api_management_api_id                  = ""
          + app_command_line                       = ""
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ application_insights_connection_string = (sensitive value)
          - application_insights_key               = (sensitive value)
          ~ ftps_state                             = "AllAllowed" -> "Disabled"
          + health_check_path                      = ""
          + remote_debugging_version               = ""
          ~ scm_minimum_tls_version                = "1.0" -> "1.2"
          + windows_fx_version                     = ""
            # (21 unchanged attributes hidden)
        }

      - sticky_settings {
          - app_setting_names       = [
              - "MICROSOFT_PROVIDER_AUTHENTICATION_SECRET",
            ] -> null
          - connection_string_names = [] -> null
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2,"Program":"tfcmt","SHA1":"","Target":"sbox-hmcts_soc_sbox-acme","Vars":{}} -->